espressif/esp32-camera/driver/cam_hal.c
                uint8_t eoi_probe[CAM_EOI_PROBE_BYTES];
                memcpy(eoi_probe, dma_buffer->buf + dma_buffer->len - probe_len, probe_len);
                int off = cam_verify_jpeg_eoi(eoi_probe, probe_len);
                if (off >= 0) {
                    offset_e = dma_buffer->len - probe_len + off;
                }
            } else {
                offset_e = cam_verify_jpeg_eoi(dma_buffer->buf, dma_buffer->len);
            }

            if (offset_e >= 0) {
                dma_buffer->len = offset_e + sizeof(JPEG_EOI_MARKER);
                if (cam_obj->psram_mode) {
                    /* DMA may bypass cache, ensure full frame is visible */
                    cam_drop_psram_cache(dma_buffer->buf, dma_buffer->len);
                }
                return dma_buffer;
            }

skip_eoi_check:

            CAM_WARN_THROTTLE(warn_eoi_miss_cnt,
                              "NO-EOI - JPEG end marker missing");
            cam_give(dma_buffer);
            continue; /* wait for another frame */
        } else if (cam_obj->psram_mode &&
                   cam_obj->in_bytes_per_pixel != cam_obj->fb_bytes_per_pixel) {
            /* currently used only for YUV to GRAYSCALE */
            dma_buffer->len = ll_cam_memcpy(cam_obj, dma_buffer->buf, dma_buffer->buf, dma_buffer->len);
        }

        if (cam_obj->psram_mode) {
            /* DMA may bypass cache, ensure full frame is visible to the app */
            cam_drop_psram_cache(dma_buffer->buf, dma_buffer->len);
        }

        return dma_buffer;
    }
}

void cam_give(camera_fb_t *dma_buffer)
{
    for (int x = 0; x < cam_obj->frame_cnt; x++) {
        if (&cam_obj->frames[x].fb == dma_buffer) {
            cam_obj->frames[x].en = 1;
            break;
        }
    }
}

void cam_give_all(void) {
    for (int x = 0; x < cam_obj->frame_cnt; x++) {
        cam_obj->frames[x].en = 1;
    }
}

bool cam_get_available_frames(void)
{
    return 0 < uxQueueMessagesWaiting(cam_obj->frame_buffer_queue);
}

void cam_set_psram_mode(bool enable)
{
    portENTER_CRITICAL(&g_psram_dma_lock);
    g_psram_dma_mode = enable;
    portEXIT_CRITICAL(&g_psram_dma_lock);
}

bool cam_get_psram_mode(void)
{
    return g_psram_dma_mode;
}
